#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsmap_77378C0F: Refreshing state... [id=/static/js/main.d6e3e6d5.js.map]
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsLICENSEtxt_5FEACFB4: Refreshing state... [id=/static/js/main.d6e3e6d5.js.LICENSE.txt]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5js_5D305F3F: Refreshing state... [id=/static/js/main.d6e3e6d5.js]
data.aws_region.Region: Reading...
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
aws_dynamodb_table.VotingAppStore_Entries_tfawsdynamodbTableDynamodbTable_76D1C895: Refreshing state... [id=Entries-e91f54ab]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.c273e9d7da6e62a0f64e5f31098616ce.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.2d8d3cceef6c2c5df2674d94c7ca0562.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.ba750766fa494349d807d8fd7a51755e.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1d68d40959470a1353582b60445c6f52.zip]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--static--css--main3451cd13cssmap_B24EB286: Refreshing state... [id=/static/css/main.3451cd13.css.map]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_object.cloudWebsite_File--static--css--main3451cd13css_A369CB42: Refreshing state... [id=/static/css/main.3451cd13.css]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=q0wnc2]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-11T02:02:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:10/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1d68d40959470a1353582b60445c6f52.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.ab36a8d794f5c1fb43c5e0ea9b187e7c.zip"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-11T02:02:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:9/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.c273e9d7da6e62a0f64e5f31098616ce.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.cd63448e1715d2b0666cdb4270de4ce6.zip"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-11T02:02:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.2d8d3cceef6c2c5df2674d94c7ca0562.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.b44c5c310e21802a86b28dd11a9fa265.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-11T02:02:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:8/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.ba750766fa494349d807d8fd7a51755e.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.e6374e220da49f25637da642020d6d25.zip"
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d2170fee1e2d25047aa6ae0cb69a7962" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1d68d40959470a1353582b60445c6f52.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1d68d40959470a1353582b60445c6f52.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.ab36a8d794f5c1fb43c5e0ea9b187e7c.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/1D68D40959470A1353582B60445C6F52/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/AB36A8D794F5C1FB43C5E0EA9B187E7C/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5209a6d79914fec0ab4cf6754a9cb5ae" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.c273e9d7da6e62a0f64e5f31098616ce.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.c273e9d7da6e62a0f64e5f31098616ce.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.cd63448e1715d2b0666cdb4270de4ce6.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/C273E9D7DA6E62A0F64E5F31098616CE/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/CD63448E1715D2B0666CDB4270DE4CE6/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7aefb843b7bcafedfc7a7c0bcef64efa" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.2d8d3cceef6c2c5df2674d94c7ca0562.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.2d8d3cceef6c2c5df2674d94c7ca0562.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.b44c5c310e21802a86b28dd11a9fa265.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/2D8D3CCEEF6C2C5DF2674D94C7CA0562/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/B44C5C310E21802A86B28DD11A9FA265/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "52296d0d98b3d91373a351dce9f6fc32" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.ba750766fa494349d807d8fd7a51755e.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.ba750766fa494349d807d8fd7a51755e.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.e6374e220da49f25637da642020d6d25.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/BA750766FA494349D807D8FD7A51755E/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/E6374E220DA49F25637DA642020D6D25/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70 will be updated in-place
  ~ resource "aws_s3_object" "cloudWebsite_File--asset-manifestjson_8187FE70" {
        id                     = "/asset-manifest.json"
      ~ source_hash            = "10b69c7fbf87e3a6843572813014d2f3" -> "2c6e0a51e8abd920539b39b9cc9b6991"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C will be updated in-place
  ~ resource "aws_s3_object" "cloudWebsite_File--indexhtml_2A2AE13C" {
        id                     = "/index.html"
      ~ source_hash            = "263cb745a7280f5d5ec4b8a68f9cb7f5" -> "e9fde7184296c040a6d5759a0a0d33d5"
        tags                   = {}
      + version_id             = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsLICENSEtxt_5FEACFB4 will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsLICENSEtxt_5FEACFB4 is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--maind6e3e6d5jsLICENSEtxt_5FEACFB4" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "8dffae291722641df11b29bdf4b1f953" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.d6e3e6d5.js.LICENSE.txt" -> null
      - key                    = "/static/js/main.d6e3e6d5.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.d6e3e6d5.js.LICENSE.txt" -> null
      - source_hash            = "8dffae291722641df11b29bdf4b1f953" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5js_5D305F3F will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5js_5D305F3F is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--maind6e3e6d5js_5D305F3F" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript; charset=utf-8" -> null
      - etag                   = "13ab082704079a1a3b93a4a76eae7cdb" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.d6e3e6d5.js" -> null
      - key                    = "/static/js/main.d6e3e6d5.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.d6e3e6d5.js" -> null
      - source_hash            = "13ab082704079a1a3b93a4a76eae7cdb" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsmap_77378C0F will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--maind6e3e6d5jsmap_77378C0F is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--maind6e3e6d5jsmap_77378C0F" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/json; charset=utf-8" -> null
      - etag                   = "dfa515e4cfddf9ba4d9c44a728cf39e5" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.d6e3e6d5.js.map" -> null
      - key                    = "/static/js/main.d6e3e6d5.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.d6e3e6d5.js.map" -> null
      - source_hash            = "dfa515e4cfddf9ba4d9c44a728cf39e5" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf1d03206jsLICENSEtxt_4D897431 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf1d03206jsLICENSEtxt_4D897431" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f1d03206.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f1d03206.js.LICENSE.txt"
      + source_hash            = "8dffae291722641df11b29bdf4b1f953"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf1d03206js_5FB083CD will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf1d03206js_5FB083CD" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f1d03206.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f1d03206.js"
      + source_hash            = "de828708e050a6f1c29d4fcd2d58ed6f"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf1d03206jsmap_6DC52951 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf1d03206jsmap_6DC52951" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f1d03206.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f1d03206.js.map"
      + source_hash            = "b769bd1c3cd7c78022ab17baa6e2de75"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 7 to add, 6 to change, 7 to destroy.

```

</details>
